```terraform
module.s3.aws_s3_bucket_public_access_block.data_question_response_video: Refreshing state... [id=matchya-staging-data-question-response-video]
module.s3.aws_s3_bucket_public_access_block.company_assets: Refreshing state... [id=matchya-staging-company-assets]
module.s3.aws_s3_bucket_policy.data_question_response_video: Refreshing state... [id=matchya-staging-data-question-response-video]
module.s3.aws_s3_bucket_policy.bucket_policy: Refreshing state... [id=matchya-staging-company-assets]
module.route53[0].data.aws_route53_zone.main: Reading...
data.aws_caller_identity.current: Reading...
module.s3.aws_s3_bucket_cors_configuration.data_question_response_video: Refreshing state... [id=matchya-staging-data-question-response-video]
module.s3.aws_s3_bucket.data_question_response_video: Refreshing state... [id=matchya-staging-data-question-response-video]
module.dynamodb.aws_dynamodb_table.access_token: Refreshing state... [id=staging-AccessToken]
module.s3.aws_s3_bucket.company_assets: Refreshing state... [id=matchya-staging-company-assets]
data.aws_caller_identity.current: Read complete after 0s [id=791901361445]
module.apigateway.aws_api_gateway_rest_api.default: Refreshing state... [id=0k8m4qkmu3]
module.app[0].aws_cloudfront_origin_access_identity.origin_access_identity: Refreshing state... [id=EKRLTFN5X725B]
module.dynamodb.aws_dynamodb_table.interview_access_token: Refreshing state... [id=staging-InterviewAccessToken]
module.iam.data.aws_iam_role.lambda_role[0]: Reading...
module.rds.aws_ssm_parameter.db_instance_password: Refreshing state... [id=/terraform/staging/rds/db_password]
module.ec2.aws_eip.nat[0]: Refreshing state... [id=eipalloc-02408c2ad93b5807a]
module.sqs.aws_sqs_queue.checklist_generation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-generation-processor-queue]
module.sqs.aws_sqs_queue.question_generation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-question-generation-processor-queue]
module.iam.data.aws_iam_role.lambda_role[0]: Read complete after 0s [id=lambda_role]
data.aws_ssm_parameter.route53_hosted_zone: Reading...
data.aws_ssm_parameter.route53_zone_id: Reading...
module.route53[0].data.aws_route53_zone.main: Read complete after 0s [id=Z0419438LZ88EPNOCFMA]
module.rds.aws_ssm_parameter.db_instance_username: Refreshing state... [id=/terraform/staging/rds/db_username]
data.aws_ssm_parameter.route53_hosted_zone: Read complete after 0s [id=/terraform/shared/route53/hosted_zone]
module.sqs.aws_sqs_queue.checklist_evaluation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-evaluation-processor-queue]
data.aws_ssm_parameter.route53_zone_id: Read complete after 0s [id=/terraform/shared/route53/zone_id]
module.vpc.aws_vpc.main[0]: Refreshing state... [id=vpc-0a42f39aad15135fd]
module.ec2.aws_key_pair.bastion[0]: Refreshing state... [id=staging-bastion_key_pair]
data.aws_region.current: Reading...
module.vpc.data.aws_vpc.default: Reading...
data.aws_region.current: Read complete after 0s [id=us-east-1]
module.apigateway.aws_ssm_parameter.api_gateway_id: Refreshing state... [id=/terraform/staging/api_gateway/id]
module.apigateway.aws_ssm_parameter.api_gateway_root_resource_id: Refreshing state... [id=/terraform/staging/api_gateway/root_resource_id]
module.sqs.aws_ssm_parameter.checklist_generation_processor_queue_url: Refreshing state... [id=/terraform/staging/sqs/checklist_generation_processor_queue_url]
module.sqs.aws_ssm_parameter.question_generation_processor_queue_url: Refreshing state... [id=/terraform/staging/sqs/question_generation_processor_queue_url]
module.sqs.aws_ssm_parameter.checklist_generation_processor_queue_arn: Refreshing state... [id=/terraform/staging/sqs/checklist_generation_processor_queue_arn]
module.sqs.aws_ssm_parameter.question_generation_processor_queue_arn: Refreshing state... [id=/terraform/staging/sqs/question_generation_processor_queue_arn]
module.sqs.aws_ssm_parameter.checklist_evaluation_processor_queue_url: Refreshing state... [id=/terraform/staging/sqs/checklist_evaluation_processor_queue_url]
module.sqs.aws_ssm_parameter.checklist_evaluation_processor_queue_arn: Refreshing state... [id=/terraform/staging/sqs/checklist_evaluation_processor_queue_arn]
aws_ssm_parameter.domain_name: Refreshing state... [id=/terraform/staging/domain_name]
module.app[0].aws_s3_bucket.www: Refreshing state... [id=www.app.staging.matchya.ai]
module.app[0].aws_s3_bucket.main: Refreshing state... [id=app.staging.matchya.ai]
module.apigateway.aws_api_gateway_gateway_response.default_5xx: Refreshing state... [id=aggr-0k8m4qkmu3-DEFAULT_5XX]
module.apigateway.aws_api_gateway_gateway_response.unauthorized_response: Refreshing state... [id=aggr-0k8m4qkmu3-UNAUTHORIZED]
module.apigateway.aws_api_gateway_gateway_response.default_4xx: Refreshing state... [id=aggr-0k8m4qkmu3-DEFAULT_4XX]
module.vpc.data.aws_vpc.default: Read complete after 0s [id=vpc-02b04f5cc72d62471]
module.app[0].aws_s3_bucket_public_access_block.main: Refreshing state... [id=app.staging.matchya.ai]
module.app[0].aws_s3_bucket_website_configuration.main: Refreshing state... [id=app.staging.matchya.ai]
module.app[0].aws_s3_bucket_public_access_block.www: Refreshing state... [id=www.app.staging.matchya.ai]
module.app[0].aws_s3_bucket_website_configuration.www: Refreshing state... [id=www.app.staging.matchya.ai]
module.app[0].aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:791901361445:certificate/eaa90423-6b07-494c-a47d-6e624b5907a6]
module.app[0].aws_s3_bucket_policy.www: Refreshing state... [id=www.app.staging.matchya.ai]
module.vpc.aws_subnet.private_2[0]: Refreshing state... [id=subnet-0a046bef38f16fe61]
module.vpc.aws_subnet.private_1[0]: Refreshing state... [id=subnet-0ab629bab96dfd8c5]
module.vpc.aws_subnet.public_1[0]: Refreshing state... [id=subnet-05111590b133297d2]
module.vpc.aws_vpc_endpoint.s3: Refreshing state... [id=vpce-099d0209a03562f08]
module.vpc.aws_ssm_parameter.vpc_id: Refreshing state... [id=/terraform/staging/vpc/id]
module.vpc.aws_security_group.rds_postgres_secure[0]: Refreshing state... [id=sg-0192b3dd3c59720be]
module.vpc.aws_subnet.public_2[0]: Refreshing state... [id=subnet-02cd6c9c839e61bd4]
module.vpc.aws_vpc_endpoint.dynamodb: Refreshing state... [id=vpce-0143703c011d0d7ec]
module.vpc.aws_security_group.lambda: Refreshing state... [id=sg-0c130afa963250ac6]
module.vpc.aws_internet_gateway.main[0]: Refreshing state... [id=igw-0626d76895be71101]
module.vpc.aws_security_group.ec2_public: Refreshing state... [id=sg-060216c9e8a326724]
module.vpc.aws_ssm_parameter.subnet_private_2[0]: Refreshing state... [id=/terraform/staging/vpc/subnet_id/private_2]
module.vpc.aws_ssm_parameter.subnet_public_1: Refreshing state... [id=/terraform/staging/vpc/subnet_id/public_1]
module.vpc.aws_nat_gateway.nat[0]: Refreshing state... [id=nat-0ebc0505978abdf4c]
module.vpc.aws_ssm_parameter.subnet_public_2: Refreshing state... [id=/terraform/staging/vpc/subnet_id/public_2]
module.app[0].aws_route53_record.cert_validation["app.staging.matchya.ai"]: Refreshing state... [id=Z0419438LZ88EPNOCFMA__6540cac5e101cd74dc59720437629215.app.staging.matchya.ai._CNAME]
module.app[0].aws_route53_record.cert_validation["www.app.staging.matchya.ai"]: Refreshing state... [id=Z0419438LZ88EPNOCFMA__d3f0f366e8ab12f2c28f8e19045dc232.www.app.staging.matchya.ai._CNAME]
module.vpc.aws_ssm_parameter.subnet_private_1[0]: Refreshing state... [id=/terraform/staging/vpc/subnet_id/private_1]
module.vpc.aws_ssm_parameter.security_group_lambda: Refreshing state... [id=/terraform/staging/vpc/security_group_id/lambda]
module.vpc.aws_security_group.vpc_endpoint[0]: Refreshing state... [id=sg-0963429656a80d368]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0145832eec236e3f1]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0871080bbdb857c7b]
module.rds.aws_db_subnet_group.secure[0]: Refreshing state... [id=staging]
module.ec2.aws_instance.bastion[0]: Refreshing state... [id=i-0fd674245c5baa6d1]
module.vpc.aws_route_table_association.public_2[0]: Refreshing state... [id=rtbassoc-0e6807b936ea3c260]
module.vpc.aws_route_table_association.public_1[0]: Refreshing state... [id=rtbassoc-0050cf9a86a6cd235]
module.vpc.aws_route_table_association.private_2[0]: Refreshing state... [id=rtbassoc-0c447198718cbd27d]
module.vpc.aws_route_table_association.private_1[0]: Refreshing state... [id=rtbassoc-02bb3e7be04b14aca]
module.app[0].aws_acm_certificate_validation.cert: Refreshing state... [id=2024-02-05 00:08:19.268 +0000 UTC]
module.app[0].aws_cloudfront_distribution.main: Refreshing state... [id=E2J209P8WUX82Y]
module.app[0].aws_cloudfront_distribution.www: Refreshing state... [id=E2ET9QF4HDTS9N]
module.rds.aws_db_instance.secure[0]: Refreshing state... [id=db-HJMRYF337M4O7ATIJXLUVTRPIU]
module.app[0].aws_ssm_parameter.cloud_distribution_url: Refreshing state... [id=/terraform/staging/cloudfront/url/app.staging.matchya.ai]
module.route53[0].aws_route53_record.app: Refreshing state... [id=Z0419438LZ88EPNOCFMA_app.staging.matchya.ai_A]
module.app[0].aws_ssm_parameter.cloudfront_distribution_id: Refreshing state... [id=/terraform/staging/www.app.staging.matchya.ai/cloudfront_distribution_id]
module.app[0].aws_ssm_parameter.www_cloud_distribution_url: Refreshing state... [id=/terraform/staging/cloudfront/url/www.app.staging.matchya.ai]
module.route53[0].aws_route53_record.www_app: Refreshing state... [id=Z0419438LZ88EPNOCFMA_www.app.staging.matchya.ai_A]
module.rds.aws_ssm_parameter.db_instance_port: Refreshing state... [id=/terraform/staging/rds/port]
module.rds.aws_ssm_parameter.db_instance_name: Refreshing state... [id=/terraform/staging/rds/db_name]
module.rds.aws_ssm_parameter.db_instance_endpoint: Refreshing state... [id=/terraform/staging/rds/endpoint]
module.ec2.aws_eip.bastion[0]: Refreshing state... [id=eipalloc-0e162e41395d4094c]
module.ec2.aws_ssm_parameter.bastion_ip[0]: Refreshing state... [id=/terraform/staging/ec2/elastic_ip/bastion_host]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.rds.aws_db_instance.secure[0] will be updated in-place
  ~ resource "aws_db_instance" "secure" {
      ~ final_snapshot_identifier             = "staging-final-snapshot-2024-02-05-00-08-18" -> (known after apply)
        id                                    = "db-HJMRYF337M4O7ATIJXLUVTRPIU"
        tags                                  = {}
        # (52 unchanged attributes hidden)
    }

  # module.s3.aws_s3_bucket.assets will be created
  + resource "aws_s3_bucket" "assets" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "matchya-assets"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.s3.aws_s3_bucket.company_assets will be destroyed
  # (because aws_s3_bucket.company_assets is not in configuration)
  - resource "aws_s3_bucket" "company_assets" {
      - arn                         = "arn:aws:s3:::matchya-staging-company-assets" -> null
      - bucket                      = "matchya-staging-company-assets" -> null
      - bucket_domain_name          = "matchya-staging-company-assets.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "matchya-staging-company-assets.s3.us-east-1.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z3AQBSTGFYJSTF" -> null
      - id                          = "matchya-staging-company-assets" -> null
      - object_lock_enabled         = false -> null
      - policy                      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:PutObject"
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = "arn:aws:s3:::matchya-staging-company-assets/*"
                      - Sid       = "DenyInsecureTransport"
                    },
                  - {
                      - Action    = "s3:GetObject"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "arn:aws:s3:::matchya-staging-company-assets/*"
                      - Sid       = "AllowPublicRead"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - region                      = "us-east-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null

      - grant {
          - id          = "aac9a733676e171bc328a7e44e7c5c7c37f5223e28542b26718df75ec0da1906" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # module.s3.aws_s3_bucket.data_question_response_video will be destroyed
  # (because aws_s3_bucket.data_question_response_video is not in configuration)
  - resource "aws_s3_bucket" "data_question_response_video" {
      - arn                         = "arn:aws:s3:::matchya-staging-data-question-response-video" -> null
      - bucket                      = "matchya-staging-data-question-response-video" -> null
      - bucket_domain_name          = "matchya-staging-data-question-response-video.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "matchya-staging-data-question-response-video.s3.us-east-1.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z3AQBSTGFYJSTF" -> null
      - id                          = "matchya-staging-data-question-response-video" -> null
      - object_lock_enabled         = false -> null
      - policy                      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "arn:aws:s3:::matchya-staging-data-question-response-video/*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - region                      = "us-east-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null

      - cors_rule {
          - allowed_headers = [
              - "*",
            ] -> null
          - allowed_methods = [
              - "POST",
              - "GET",
              - "PUT",
            ] -> null
          - allowed_origins = [
              - "app.staging.matchya.ai",
            ] -> null
          - expose_headers  = [
              - "ETag",
            ] -> null
          - max_age_seconds = 3000 -> null
        }

      - grant {
          - id          = "aac9a733676e171bc328a7e44e7c5c7c37f5223e28542b26718df75ec0da1906" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # module.s3.aws_s3_bucket.user_data will be created
  + resource "aws_s3_bucket" "user_data" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "matchya-user-data"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.s3.aws_s3_bucket_cors_configuration.data_question_response_video will be destroyed
  # (because aws_s3_bucket_cors_configuration.data_question_response_video is not in configuration)
  - resource "aws_s3_bucket_cors_configuration" "data_question_response_video" {
      - bucket = "matchya-staging-data-question-response-video" -> null
      - id     = "matchya-staging-data-question-response-video" -> null

      - cors_rule {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.s3.aws_s3_bucket_cors_configuration.user_data will be created
  + resource "aws_s3_bucket_cors_configuration" "user_data" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + cors_rule {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.s3.aws_s3_bucket_policy.assets will be created
  + resource "aws_s3_bucket_policy" "assets" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.s3.aws_s3_bucket_policy.bucket_policy will be destroyed
  # (because aws_s3_bucket_policy.bucket_policy is not in configuration)
  - resource "aws_s3_bucket_policy" "bucket_policy" {
      - bucket = "matchya-staging-company-assets" -> null
      - id     = "matchya-staging-company-assets" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:PutObject"
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = "arn:aws:s3:::matchya-staging-company-assets/*"
                      - Sid       = "DenyInsecureTransport"
                    },
                  - {
                      - Action    = "s3:GetObject"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "arn:aws:s3:::matchya-staging-company-assets/*"
                      - Sid       = "AllowPublicRead"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
    }

  # module.s3.aws_s3_bucket_policy.data_question_response_video will be destroyed
  # (because aws_s3_bucket_policy.data_question_response_video is not in configuration)
  - resource "aws_s3_bucket_policy" "data_question_response_video" {
      - bucket = "matchya-staging-data-question-response-video" -> null
      - id     = "matchya-staging-data-question-response-video" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "arn:aws:s3:::matchya-staging-data-question-response-video/*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
    }

  # module.s3.aws_s3_bucket_policy.user_data will be created
  + resource "aws_s3_bucket_policy" "user_data" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.s3.aws_s3_bucket_public_access_block.assets will be created
  + resource "aws_s3_bucket_public_access_block" "assets" {
      + block_public_acls       = false
      + block_public_policy     = false
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + restrict_public_buckets = false
    }

  # module.s3.aws_s3_bucket_public_access_block.company_assets will be destroyed
  # (because aws_s3_bucket_public_access_block.company_assets is not in configuration)
  - resource "aws_s3_bucket_public_access_block" "company_assets" {
      - block_public_acls       = false -> null
      - block_public_policy     = false -> null
      - bucket                  = "matchya-staging-company-assets" -> null
      - id                      = "matchya-staging-company-assets" -> null
      - ignore_public_acls      = false -> null
      - restrict_public_buckets = false -> null
    }

  # module.s3.aws_s3_bucket_public_access_block.data_question_response_video will be destroyed
  # (because aws_s3_bucket_public_access_block.data_question_response_video is not in configuration)
  - resource "aws_s3_bucket_public_access_block" "data_question_response_video" {
      - block_public_acls       = false -> null
      - block_public_policy     = false -> null
      - bucket                  = "matchya-staging-data-question-response-video" -> null
      - id                      = "matchya-staging-data-question-response-video" -> null
      - ignore_public_acls      = false -> null
      - restrict_public_buckets = false -> null
    }

  # module.s3.aws_s3_bucket_public_access_block.user_data will be created
  + resource "aws_s3_bucket_public_access_block" "user_data" {
      + block_public_acls       = false
      + block_public_policy     = false
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + restrict_public_buckets = false
    }

Plan: 7 to add, 1 to change, 7 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: environment.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "environment.tfplan"

```